loadtests/top_sellers.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 20
      name: "Warming up"
    - duration: 240
      arrivalRate: 20
      rampTo: 100
      name: "Ramping up"
    - duration: 500
      arrivalRate: 100
      name: "Sustained load"
 
scenarios:
  - name: "Get top sellers"
    flow:
      - get:
          url: "/api/users/top-sellers"